# -*- coding: utf-8 -*-

token = ''
forward_group_id =

# кнопки
button_menu = '📋 Меню ресторана'
button_cart = '🛒 Что в корзине?'
button_checkout = '🛵 Оформить заказ'
button_back = '⏪ Назад'
button_clear_cart = '🔄 Очисть корзину'
button_send_phone_number = "☎ Отправить номер телефона"
button_send_location = "🗺 Отправить текущее местоположение"

# сообщения от бота
no_product_message = "В этой категории пока нет товаров."
choose_category_message = "Пожалуйста, выберите, что хотите заказать"
welcome_message = "Здравствуйте. Я - бот по приему заявок на доставку еды с ресторана, чтобы вы хотели сделать?"
phone_message = 'Ваш номер телефона?\n Нажмите на кнопку ниже или введите его (только цифры)'
thanks_message = '🔥 Спасибо, заявка создана! Скоро мы с Вами обязательно свяжемся.'

# сообщения от бота об ошибках
dont_know_message = "Я не обучен отвечать на такие сообщения..."
error_image_message = 'Я не понимаю фото, напишите текст'
exception_message = 'Ой, какая-то ошибка. Если ничего не происходит попробуйте меня перезапустить.'
